app/views/projects/dashboard.html.erb

                      <div class="card-body">
                        <% if project.bids.empty?%>
---
SELECT  1 AS one FROM "bids" WHERE "bids"."project_id" = $1 LIMIT $2  [["project_id", 23], ["LIMIT", 1]]
SELECT "bids".* FROM "bids" WHERE "bids"."project_id" = $1  [["project_id", 16]]

                        <% else %>
                          <% project.bids.each do |bid| %>
---
SELECT "bids".* FROM "bids" WHERE "bids"."project_id" = $1  [["project_id", 31]]

              <td><%= link_to project.title, project_path(project.id) %></td>
              <td><%= link_to project.bids.where(:status => "accepted")[0].user.name, profile_path(project.bids.where(:status => "accepted")[0].user_id), method: :get %></td>
---
SELECT "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2  [["project_id", 34], ["status", 1]]

              <td><%= link_to project.title, project_path(project.id) %></td>
              <td><%= link_to project.bids.where(:status => "accepted")[0].user.name, profile_path(project.bids.where(:status => "accepted")[0].user_id), method: :get %></td>
---
SELECT "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2  [["project_id", 31], ["status", 1]]