app/controllers/bids_controller.rb

SELECT  "bids".* FROM "bids" WHERE "bids"."user_id" = $1 AND "bids"."project_id" = $2 LIMIT $3  [["user_id", 33], ["project_id", 22], ["LIMIT", 1]]
INSERT INTO "bids" ("status", "project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 0], ["project_id", 22], ["user_id", 33], ["created_at", "2018-11-06 01:07:13.023055"], ["updated_at", "2018-11-06 01:07:13.023055"]]
---
  def create
    # To place a bid - user must a dev and not already have a bid
    if current_user.user_type == "dev" && current_user.bids.find_by(:project_id => params[:project_id]) == nil
      @bid = Bid.new
      @bid.project_id = params[:project_id]
      @bid.user_id = current_user.id
      @bid.save

SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "bids" SET "status" = $1, "updated_at" = $2 WHERE "bids"."id" = $3  [["status", 1], ["updated_at", "2018-11-06 01:08:01.701472"], ["id", 17]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "status" = $1, "deadline" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["status", 1], ["deadline", "2018-11-13"], ["updated_at", "2018-11-06 01:08:01.717922"], ["id", 22]]
SELECT "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2  [["project_id", 20], ["status", 0]]
SELECT "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2  [["project_id", 22], ["status", 0]]
UPDATE "bids" SET "status" = $1, "updated_at" = $2 WHERE "bids"."id" = $3  [["status", 2], ["updated_at", "2018-11-07 10:41:15.611253"], ["id", 171]]
---
  def accept_bid
    @accepted_bid = Bid.find(params[:bid_id])
    @accepted_bid.status = 1
    @accepted_bid.save

    # Changing the project status to 'In Progress' and setting the project deadline
    @project = Project.find(params[:project_id])
    @project.status = 1
    @project.deadline = Date.today + Product.find(@project.product_id).duration
    @project.save

    # Rejecting all other project bids
    @rejected_bids = Bid.where(:project_id => @project.id, :status => 0)
    @rejected_bids.each do |bid|
      bid.status = 2
      bid.save