app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index
    @products = Product.all
    @product_1 = Product.find(1)
    @product_2 = Product.find(2)
    @product_3 = Product.find(3)