app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE (user_type = 'dev')
---
  def index
    @devs = User.where("user_type = 'dev'")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
  def set_dev
    @dev = User.find(params[:id])