app/controllers/projects_controller.rb

  def index
    @products = Product.all # for filtering options
    # # ordered projects from oldest to newest, limit 20 results
    @projects = if params[:filter].present?
                  Project.where(:product_id => params[:filter]).order(updated_at: "asc").limit(20)
                else
                  Project.all.order(updated_at: "asc").limit(20)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."product_id" = $1 ORDER BY "projects"."updated_at" ASC LIMIT $2  [["product_id", 2], ["LIMIT", 20]]
SELECT  "projects".* FROM "projects" ORDER BY "projects"."updated_at" ASC LIMIT $1  [["LIMIT", 20]]

  def create
    @project = Project.new(project_params)
    @project.user_id = current_user.id
    @project.save
---
INSERT INTO "projects" ("price", "title", "overview", "description", "deadline", "status", "user_id", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    # @rating = Rating.new # for creating a new rating - client
    @rated = @project.rating # for showing an existing rating

    @bid = Bid.new # for creating a new bid - devs
    @bids = @project.bids # bids for this project
    if @project.bids.find_by(:status => 2) != nil # check if there accepted bid
      @accepted_dev = @project.bids.find_by(:status => 2).user
---
SELECT  "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2 LIMIT $3  [["project_id", 16], ["status", 2], ["LIMIT", 1]]
SELECT  "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2 LIMIT $3  [["project_id", 17], ["status", 2], ["LIMIT", 1]]

  def dashboard
    @open = Project.where("user_id = #{current_user.id} AND status = 0")
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def dashboard_developer
    @pending_bids = Bid.where("user_id = #{current_user.id} AND status = 0")
---
SELECT  "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2 LIMIT $3  [["project_id", 22], ["status", 2], ["LIMIT", 1]]

  def cancel_bid # For Developers
    Bid.find(params[:id]).destroy
---
DELETE FROM "bids" WHERE "bids"."id" = $1  [["id", 5]]
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]