app/controllers/projects_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all # for filtering options

SELECT "products".* FROM "products"
---
  def new
    if current_user.user_type == "client"
      @project = Project.new
      @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "projects" ("price", "title", "overview", "description", "status", "user_id", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    if current_user.user_type == "client"
    # begin
      @project = Project.new(project_params)
      product_id = params[:project][:product_id]
      # raise "Please complete project form" unless product_id.empty?

      amount = Product.find(product_id).price
      # raise "Please complete project form" unless amount.nil?

      @project.user_id = current_user.id
      @project.price = amount

      if @project.save
        charge = stripe_payment(amount)
        @project.charge_id = charge.id
        @project.save

SELECT  "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2 LIMIT $3  [["project_id", 31], ["status", 1], ["LIMIT", 1]]
---
  def show
    @rating = Rating.new # for creating a new rating - client
    @rated = @project.rating # for showing an existing rating

    @bid = Bid.new # for creating a new bid - devs
    @bids = @project.bids # bids for this project
    if @project.bids.find_by(:status => 1) != nil # check if there accepted bid
      @accepted_dev = @project.bids.find_by(:status => 1).user

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
  def dashboard
    if current_user.user_type == "client"
      @open = Project.where("user_id = #{current_user.id} AND status = 0")
      @ongoing = Project.where("user_id = #{current_user.id} AND status = 1")
      @completed = Project.where("user_id = #{current_user.id} AND status = 2")

SELECT  "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2 LIMIT $3  [["project_id", 20], ["status", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
  def dashboard_developer
    if current_user.user_type == "dev"
      @pending_bids = Bid.where("user_id = #{current_user.id} AND status = 0")

DELETE FROM "bids" WHERE "bids"."id" = $1  [["id", 3]]
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def cancel_bid # For Developers
    if Bid.find(params[:id]).destroy