app/controllers/ratings_controller.rb

  def create
    @rating = Rating.new(params.require(:rating).permit(:rate, :testimony, :project_id))
    @rating.project_id = params[:project_id]

    accepted_dev = @rating.project.bids.find_by(status: 1).user_id
    dev = User.find(accepted_dev)

    respond_to do |format|
      if @rating.save
        # update_overall_rating
        dev.overall_rating = RatingService::calculate_overall_rating(@rating, dev)
        dev.save
---
SELECT  "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2 LIMIT $3  [["project_id", 31], ["status", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
UPDATE "users" SET "overall_rating" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["overall_rating", 4.0], ["updated_at", "2018-11-08 00:11:42.680747"], ["id", 62]]
INSERT INTO "ratings" ("rate", "testimony", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rate", 5], ["testimony", "Awesome dev!"], ["project_id", 31], ["created_at", "2018-11-07 23:32:20.210333"], ["updated_at", "2018-11-07 23:32:20.210333"]]
UPDATE "users" SET "overall_rating" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["overall_rating", 5.0], ["updated_at", "2018-11-07 23:32:20.231294"], ["id", 63]]