app/controllers/ratings_controller.rb

  def update_overall_rating
    completed_projects = []
    ratings = []

    # Query for the Dev of this project
    accepted_dev = @rating.project.bids.find_by(status: 1).user_id
    dev = User.find(accepted_dev)
    # Query for the all projects the Dev was accepted
    dev_accepted_bids = dev.bids.where(status: 1)

    # Filter the query for the all projects completed by the Dev
    dev_accepted_bids.each do |bid|
      if bid.project.status == "completed"
        completed_projects.push(bid)
      end
    end

    # Filter the query for the all projects that rated the Dev
    completed_projects.each do |bid|
      if bid.project.rating != nil
        ratings.push(bid.project.rating.rate)
      end
    end
    # Calculate new overall average rating and save to User table
    updated_overall_rating = ratings.sum / ratings.size.to_f
    dev.overall_rating = updated_overall_rating
    dev.save
---
SELECT  "bids".* FROM "bids" WHERE "bids"."project_id" = $1 AND "bids"."status" = $2 LIMIT $3  [["project_id", 22], ["status", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = $1 AND "bids"."status" = $2  [["user_id", 33], ["status", 1]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."project_id" = $1 LIMIT $2  [["project_id", 15], ["LIMIT", 1]]
UPDATE "users" SET "overall_rating" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["overall_rating", 5.0], ["updated_at", "2018-11-06 03:16:48.768874"], ["id", 33]]